namespace LAB03
{
    public class Program
    {
        public static void Main(string[] args)
        {
            // Задание 1.1 (Код проверки пишем ниже)


            // Задание 1.2 (Код проверки пишем ниже)


            // Задание 1.3 (Код проверки пишем ниже)


            // Задание 1.4 (Код проверки пишем ниже)


            // Задание 2.1 (Код проверки пишем ниже)


            // Задание 2.2 (Код проверки пишем ниже)


            // Задание 3.1 (Код проверки пишем ниже)


            // Задание 3.2 (Код проверки пишем ниже)
        }
    }
}